let jokes = [
    {
        joke: "ایک خاتون نے دوسری خاتون سے پو چھا۔”جنت میں مردوں کو تو حوریں ملیں گی مگر عورتوں کو کیا ملے گا؟“ ”یہی اپنے اپنے خاوند۔“ دوسری عورت نے جواب میں بتایا۔ پہلی عورت نے یہ سنا تو تلخی سے بولی۔”دفع کرو پھر مرنے کا کیا فائدہ۔“"
    },
    {
        joke:"پولیس والا اپنے بیٹے سے: تمہارا رزلٹ بہت برا آیا ہے آج سے تمہارا کھیلنا اور ٹیوی دیکھنا بند بیٹا: یہ پچاس روپے پکڑو اور اس بات کو یہیں ختم کرو  "
    },
    {
        joke:  "شاگرد: ہزاروں کی قسمت تیرے پاس تھی، اگر پاس کرتے تو کیا بات تھی۔استاد : کتابیں تو ساری تیرے پاس تھیں، اگر یاد کرتے تو کیا بات تھی"
    },
    {
        joke: "ایل بی ڈبلیو کی پانچویں اپیل بھی منظو رنہ ہوئی تو باؤلر کو تاؤ آگیا۔ وہ ایمپائر کی طرف پلٹا اور غصے سے بولا۔ جناب عالی! یہ تو بتائیے آپ کی چھڑی کہاں ہے؟“ ”چھڑی؟ کیسی چھڑی ، میرے پاس کوئی چھڑی نہیںایمپائر نے حیرت سے کہا۔ ”کمال ہے۔“ باؤلر غرایا۔” میں نے کسی اندھے کو بغیر چھڑی کے نہیں دیکھ"
    }
]
let index = 0


function showJokes() {
    let jokeDiv = document.getElementById("joke");
    jokeDiv.className="jokeFont"
    jokeDiv.innerHTML = jokes[index].joke
}
showJokes()
let nextBtn = document.getElementById("btn")
nextBtn.addEventListener('click', () => {
    index = (index + 1) % jokes.length
    showJokes()
})

